v2206/atmospheric_AloisLuggerPlatz/actuator/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication decomposePar

# runApplication $(getApplication)

runParallel topoSet

runParallel $(getApplication)

runApplication reconstructPar

rm -rf proc*

touch ABLact.foam

#------------------------------------------------------------------------------
